Not sure if I misunderstood the soft delete explanation,
but it looks like the previous version is gone after the terraform run..


List schema before change

```bash
confluent schema-registry schema list
  Schema ID |                Subject        | Version  
------------+-------------------------------+----------
     100005 | examples.v1alpha.other_record |       1  
     # ...
     
```

List describe schema before change
```bash
confluent schema-registry schema describe -S examples.v1alpha.other_record -V 1

Schema ID: 100005
Type: PROTOBUF
Schema: syntax = "proto3";
package examples.v1alpha;

message SomeOtherRecord {
  string value1 = 1;
}    
```

Terraform apply
```terraform
# module.kafka.confluent_schema.schemas["examples.v1alpha.other_record"] must be replaced
-/+ resource "confluent_schema" "schemas" {
      ~ id                = "xxxx-xxxxxx/examples.v1alpha.other_record/100005" -> (known after apply)
      ~ schema            = <<-EOT # forces replacement
            syntax = "proto3";
            package examples.v1alpha;
            
            message SomeOtherRecord {
              string value1 = 1;
          +   string value2 = 2;
            }
        EOT
      ~ schema_identifier = 100005 -> (known after apply)
      ~ version           = 1 -> (known after apply)
        # (3 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }
```

List schemas after change
```bash
confluent schema-registry schema list
  Schema ID |                Subject        | Version  
------------+-------------------------------+----------
     100006 | examples.v1alpha.other_record |       2  
     # ...
```

List describe schema before change
```
confluent schema-registry schema describe -S examples.v1alpha.other_record -V 1
Error: schema registry subject or version not found
```